Revit 2027 API
IntersectionType Enumeration
 Intersection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IntersectionType
Public Enumeration IntersectionType
public enum class IntersectionType
type IntersectionType
Members
Member name | Value | Description
Cut | 0 |  Cut
Excavate | 1 |  Excavate
See Also
Reference
Autodesk.Revit.DB Namespace